# На вход программе подается строка текста.
# Напишите программу, которая определяет количество различных символов в строке.
#
# Формат входных данных
# На вход программе подается строка текста.
#
# Формат выходных данных
# Программа должна вывести количество различных символов в строке.
#
# Примечание. Задачу можно решить в одну строчку кода.


print(len(set(input())))
